const removePersonData = (inputString: string): string => {
  let text = inputString;

  // Name
  text = text.replace(
    /(?:[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ]\.\s+[А-ЯЁ]\.|[А-ЯЁ]\.[А-ЯЁ]\.\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ]\.\s+[А-ЯЁ]\.|[А-ЯЁ]\.\s+[А-ЯЁ]\.\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?|[А-ЯЁ]\.\s+[А-ЯЁ]\.\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ]\.\s+[А-ЯЁ]\.|[А-ЯЁ]\.[А-ЯЁ]\.\s+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?[А-ЯЁ]\.\s+[А-ЯЁ]\.|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?\s+[А-ЯЁ]\.[А-ЯЁ]\.)/g,
    "**** ****"
  );

  //Passport
  text = text.replace(/\b\d{4}\s\d{6}\b/g, "**** ****");

  // Email
  text = text.replace(/[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,}/g, "email@example.com");

  // Phone
  text = text.replace(
    /\+7 \(\d{3}\) \d{3}-\d{2}-\d{2}|\+7 \d{3} \d{3}-\d{2}-\d{2}|\+7 \d{3} \d{3} \d{2} \d{2}|\+7-\d{3}-\d{3}-\d{2}-\d{2}|\+7 \(\d{3}\) \d{3} \d{2} \d{2}|8 \(\d{3}\) \d{3}-\d{2}-\d{2}|8 \d{3} \d{3}-\d{2}-\d{2}|8 \d{3} \d{3} \d{2} \d{2}|8-\d{3}-\d{3}-\d{2}-\d{2}|8 \(\d{3}\) \d{3} \d{2} \d{2}|\(\d{3}\) \d{3}-\d{2}-\d{2}|\d{3} \d{3}-\d{2}-\d{2}|\d{3} \d{3} \d{2} \d{2}|\(\d{3}\) \d{3} \d{2} \d{2}|\+7\d{10}|\+7\s\d{3}-\d{3}-\d{2}-\d{2}|8\d{10}|\+7\s\d{3}\s\d{3}\s\d{2}\s\d{2}|8\s\d{3}-\d{3}-\d{2}-\d{2}|\(\d{4}\)\s\d{2}-\d{2}-\d{3}|\d{4}-\d{2}-\d{3}|8\s\d{4}\s\d{2}\s\d{3}|\+7\s\d{4}\s\d{2}\s\d{3}|\b\d{11}\b/g,
    "**********"
  );

  // Postal code
  text = text.replace(/\b\d{6}\b/g, "******");

  return text;
};

export { removePersonData };
