const removeAmountByPart = (inputString: string): string => {
  let text = inputString;

  // RUB
  text = text.replace(
    /\d{1,3}(?:[ .]?\d{3})*(?:,00|\.00)?(?:\s*\([^)]*\))?(?=\s*(?:руб(?:лей|\.|)|р(?:уб|)\.|₽|тыс(?:\.|яч|)\s*руб(?:\.|лей|)|млн\s*руб(?:\.|лей|)|мил(?:\.|лионов|лиона|лион|)\s*руб(?:\.|лей|)|млрд(?:\.|ов|а|)\s*руб(?:\.|лей|)))/g,
    "**********"
  );

  // RUB with kop
  text = text.replace(
    /\d{1,3}(?:[ .]?\d{3})*(?=\s*руб(?:лей|)\s*\d{1,2}\s*коп(?:еек|\.|))|\d{1,3}(?:[ .]?\d{3})*(?=\s*р(?:уб|)\.\s*\d{1,2}\s*коп(?:\.|\.|еек|))|\d{1,3}(?:[ .]?\d{3})*(?=\s*₽\s*\d{1,2}\s*коп(?:\.|\.|еек|))|\d{1,3}(?:[ .]?\d{3})*[,.]\d{2}(?=\s*руб(?:\.|\.|лей|))|\d{1,3}(?:[ .]?\d{3})*[,.]\d{2}(?=\s*р(?:уб|)\.)/g,
    "**********"
  );

  // USD, EURO
  text = text.replace(
    /\d{1,3}(?:[ .]?\d{3})*(?=\s*\$)|\d{1,3}(?:[ .]?\d{3})*(?=\s*USD)|\d{1,3}(?:[ .]?\d{3})*(?=\s*долл(?:\.?\s?|аров|ары|))|\d{1,3}(?:[ .]?\d{3})*[,.]\d{2}(?=\s*\$)|\d{1,3}(?:[ .]?\d{3})*[,.]\d{2}(?=\s*USD)|\d{1,3}(?:[ .]?\d{3})*(?=\s*€)|\d{1,3}(?:[ .]?\d{3})*(?=\s*EUR)|\d{1,3}(?:[ .]?\d{3})*(?=\s*евро)|\d{1,3}[,.]\d{2}(?=\s*€)|\d{1,3}[,.]\d{2}(?=\s*EUR)/g,
    "**********"
  );

  // UAN
  text = text.replace(
    /\d{1,3}(?:[ .]?\d{3})*(?=\s*юан(?:ей|ь|я))|\d{1,3}(?:[ .,]?\d{3})*(?=\s*CNY)|\d{1,3}(?:[ .]?\d{3})*(?=\s*¥)|\d{1,3}(?:,00|\.00)(?=\s*юан(?:ей|ь|я))|\d{1,3}(?:,00|\.00)(?=\s*CNY)|\d{1,3}(?:,00|\.00)(?=\s*¥)|\d{1,3}(?:[ .]?\d{3})*(?=\s*тыс(?:\.|яч|)\s*юан(?:ей|ь|я))|\d{1,3}(?:[ .]?\d{3})*(?=\s*тыс(?:\.|яч|)\s*CNY)|\d{1,3}(?:[ .]?\d{3})*(?=\s*тыс(?:\.|яч|)\s*¥)|\d{1,3}(?:[ .]?\d{3})*(?=\s*мил(?:\.|лионов|лиона|лион|)\s*юан(?:ей|ь|я))|\d{1,3}(?:[ .]?\d{3})*(?=\s*мил(?:\.|лионов|лиона|лион|)\s*CNY)|\d{1,3}(?:[ .]?\d{3})*(?=\s*мил(?:\.|лионов|лиона|лион|)\s*¥)|\d{1,3}(?:[ .]?\d{3})*(?=\s*млрд(?:\.|ов|а|)\s*юан(?:ей|ь|я))|\d{1,3}(?:[ .]?\d{3})*(?=\s*млрд(?:\.|ов|а|)\s*CNY)|\d{1,3}(?:[ .]?\d{3})*(?=\s*млрд(?:\.|ов|а|)\s*¥)/g,
    "**********"
  );

  return text;
};

export { removeAmountByPart };
