const removeAddressesByPart = (inputString: string): string => {
  let text = inputString;

  // city
  text = text.replace(/(?<=(?:(?<![а-яёА-ЯЁ])г\.\s?|город\s?))(?:[А-ЯЁ][а-яё]+(?:[ -][А-ЯЁ][а-яё]+)*)/g, "******");

  // other city
  text = text.replace(/(?<=(?:н\.п\.?\s?|населенный\s*пункт\s?))(?:[А-ЯЁ][а-яё]+(?:[ -][А-ЯЁ][а-яё]+)*)/g, "*********");

  // highway
  // text = text.replace(
  //   /(?<=(?:шоссе\s?|ш\.?\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?шоссе)/g,
  //   "********"
  // );
  text = text.replace(/(шоссе|ш\.?|ш)\s.+?(?=\s|$)/g, "**********");

  // Street
  text = text.replace(
    /(?<=(?:ул\.?\s?|ул\.|улица\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:улица|ул\.\s?))/g,
    "**********"
  );

  // Prospekt
  text = text.replace(
    /(?<=(?:пр-т\.?\s?|пр-т\.|проспект\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:пр-т\.?\s?|пр-т\.|проспект\s?))/g,
    "**********"
  );

  // Pereulok
  text = text.replace(
    /(?<=(?:пер\.?\s?|пер\.|переулок\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:пер\.\s?|переулок))/g,
    "**********"
  );

  // Proezd
  text = text.replace(
    /(?<=(?:проезд\s?|пр-д\s?|пр-зд\s?|пр\.\s?|пр-д|пр-зд|пр\.))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:проезд|пр-д|пр-зд|пр\.))/g,
    "**********"
  );

  // Bulevar
  text = text.replace(
    /(?<=(?:б-р\.\s?|б-р\.|бульвар\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:б-р\.\s?|б-р\.|бульвар))/g,
    "**********"
  );

  // Square
  text = text.replace(
    /(?<=(?:пл\.\s?|пл\.|площадь\s?))(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*)|(?:[А-ЯЁа-яё0-9]+(?:[ -][А-ЯЁа-яё0-9]+)*\s?(?:пл\.\s?|пл\.|площадь))/g,
    "**********"
  );

  // House
  text = text.replace(
    /(?<=(?:(?<![а-яёА-ЯЁ])д\.\s?|дом\s?))(?:\d+[а-я]?)|(?:\d+[а-я]?\s?(?:д\.\s?|д\.|дом))/g,
    "**********"
  );

  // korp
  text = text.replace(
    /(?<=(?:корп\.\s?|корп\.|корпус\s?))(?:\d+[а-я]?)|(?:\d+[а-я]?\s?(?:корп\.\s?|корп\.|корпус))/g,
    "**********"
  );

  // build
  text = text.replace(
    /(?<=(?:(?<![а-яёА-ЯЁ])стр\.\s?|строение\s?))(?:\d+[а-я]?)|(?:\d+[а-я]?\s?(?:стр\.\s?|стр\.|строение))/g,
    "**********"
  );

  // office
  text = text.replace(
    /(?<=(?:оф\.\s?|оф\.|офис\s?))(?:\d+[а-я]?)|(?:\d+[а-я]?\s?(?:оф\.\s?|оф\.|офис))/g,
    "**********"
  );

  // flat
  text = text.replace(
    /(?<=(?:кв\.\s?|кв\.|квартира\s?))(?:\d+[а-я]?)|(?:\d+[а-я]?\s?(?:кв\.\s?|кв\.|квартира))/g,
    "**********"
  );

  // region
  text = text.replace(
    /(?:[А-ЯЁ][а-яё]+\s*область)|(?:[А-ЯЁ][а-яё]+\s*обл\.)|(?:[А-ЯЁ][а-яё]+\s*край)|(?:[А-ЯЁ][а-яё]+\s*кр\.)|(?:Республика\s*[А-ЯЁ][а-яё]+)|(?:Респ\.\s*[А-ЯЁ][а-яё]+)/g,
    "**********"
  );

  return text;
};

export { removeAddressesByPart };
