const removeContract = (inputString: string): string => {
  let text = inputString;

  // Contract
  text = text.replace(
    /(?<=(?:Договор|Контракт|Акт|Счет|Заказ|Заявка|Приказ|Протокол|Банковская\sгарантия|Уведомление|Распоряжение|Свидетельство|Паспорт|Платежное\sпоручение|Справка|Накладная|Реестр|Соглашение|Дополнительное\sсоглашение|Доп\.?\sсоглашение|Постановление|Решение|Претензия|Апелляция|Заявление|Устав|Патент|Сертификат|Доверенность)\s№\s?)[\dА-ЯЁа-яёA-Za-z/-]+|(?<=Регистрационный\sномер\s)[\dА-ЯЁа-яёA-Za-z/-]+|(?<=Регистрационный\s№\s?)[\dА-ЯЁа-яёA-Za-z/-]+|(?<=Рег\s№\s?)[\dА-ЯЁа-яёA-Za-z/-]+|(?<=№\d{2}-\d{2})\d+|(?<=№\d{4}-)\d{2}|(?<=№)\d{2}\/\d+/gi,
    "**********"
  );

  // Series and number (серия 77 № 004202429)
  text = text.replace(/серия\s+\S+\s+№\s?\d+/gi, "** ******");

  return text;
};

export { removeContract };
