const removePayment = (inputString: string): string => {
  let text = inputString;

  // R/bill and Korr/bill 20
  text = text.replaceAll(
    /(?<=(?:р\/с\s*(?:-\s*|:\s*)?|р\/сч\.\s*:\s*|р\/сч\s*(?:-\s*|:\s*)?|расчетный\s*счет\s*(?:-\s*|:\s*)?|расчетного\s*счета\s*(?:-\s*|:\s*)?))(\d{20}|\d{3}\s*\d{3}\s*\d{3}\s*\d{3}\s*\d{3}\s*\d{2}|\d{3}-\d{3}-\d{3}-\d{3}-\d{3}-\d{2}|\d{3}\s*\d{3}\d{12})/g,
    "************"
  );

  // OGRN 13 - 15 numbers
  text = text.replaceAll(
    /(?<=(?:ОГРН\s*(?:организации\s*|юридического\s*лица\s*|(?:-\s*|:\s*|–\s*))?|Основной\s*государственный\s*регистрационный\s*номер\s*(?:\(ОГРН\)\s*|–\s*)?|ОГРНИП\s*(?:-\s*|:\s*)?))(\d{13}|\d{15}|\d{3}\s*\d{3}\s*\d{3}\s*\d{4}|\d{3}-\d{3}-\d{3}-\d{4}|\d{3}-\d{3}-\d{6}|\d{3}\s*\d{3}\s*\d{6})/g,
    "************"
  );

  // ИНН 10 - 12 цифр
  text = text.replaceAll(
    /(?<=ИНН\s*(?:организации\s*|физического\s*лица\s*|:\s*|:\s*организации\s*|:\s*физического\s*лица\s*|\(ИП\)\s*|\(физ\.\s*лицо\)\s*)?)(?:\d{10}|\d{12}|\d{3}\s*\d{3}\s*\d{3}\s*\d|\d{3}-\d{3}-\d{3}-\d|\d{3}-\d{3}-\d{4}|\d{3}\s*\d{3}\s*\d{4}|\d{3}\s*\d{3}\s*\d{6}|\d{3}-\d{3}-\d{6})/g,
    "***********"
  );

  // КПП
  text = text.replaceAll(
    /(?<=(?:КПП\s*(?:организации\s*|физ\.\s*лица\s*|(?:-\s*|:\s*)?)))((?:\d{9}|\d{3}\s*\d{3}\s*\d{3}|\d{3}-\d{3}-\d{3}))/g,
    "*********"
  );

  return text;
};

export { removePayment };
